artillerytest/chat_test.yml
config:
  target: "http://localhost:5001"
  phases:
    - duration: 20
      arrivalRate: 5
      maxVusers: 50
      name: 8 users in a challenge42
  payload:
    path: "test_file1.csv"
    fields:
      - "email"
      - "password"
      - "nickname"
    # order: sequence
scenarios:
  - name: "Test_case_2"
    engine: "socketio"
    flow:
      - log: "{{email}} socket connection 시도"
      - log: "{{email}}  login 시도"
      - post:
          url: "http://localhost:5000/api/user/login"
          json:
            email: "{{email}}"
            pwd: "{{password}}"
      - think: 1
      - get:
          url: "http://localhost:5000/api/user/challenges/ids"
      # - log: "{{email}} Challenge-42 페이지 접근"
      - get:
          url: "http://localhost:5000/api/challenge/42"
      - get:
          url: "http://localhost:5000/api/chat/42"
      # - log: "test"
      - emit:
          channel: "join"
          data:
            id: 1
            "challenges": [id: 42, id: 1, id: 2, id: 3, id: 4]
      - log: "{{email}} Challenge room 입장"
      - loop:
          - emit:
              channel: "send_message"
              data:
                challengeId: 42
                "user_nickname": "{{nickname}}"
                "message": "소켓 채팅테스트 중입니다. {{$loopCount}}"
                "time": "11월 29일 Test"
              acknowledge:
                match:
                  json: "response"

          - think: 0.2
          - emit:
              channel: "send_message"
              data:
                challengeId: 1
                "user_nickname": "{{nickname}}"
                "message": "소켓 채팅테스트 중입니다. {{$loopCount}}"
                "time": "11월 29일 Test"
              acknowledge:
                match:
                  json: "response"

          - think: 0.2
          - emit:
              channel: "send_message"
              data:
                challengeId: 2
                "user_nickname": "{{nickname}}"
                "message": "소켓 채팅테스트 중입니다. {{$loopCount}}"
                "time": "11월 29일 Test"
              acknowledge:
                match:
                  json: "response"
          - think: 0.2
          - emit:
              channel: "send_message"
              data:
                challengeId: 3
                "user_nickname": "{{nickname}}"
                "message": "소켓 채팅테스트 중입니다. {{$loopCount}}"
                "time": "11월 29일 Test"
              acknowledge:
                match:
                  json: "response"
          - think: 0.2
          - emit:
              channel: "send_message"
              data:
                challengeId: 4
                "user_nickname": "{{nickname}}"
                "message": "소켓 채팅테스트 중입니다. {{$loopCount}}"
                "time": "11월 29일 Test"
              acknowledge:
                match:
                  json: "response"
          - think: 0.2
        count: 200